function I = IR_Spectra(Fr, Dr, q, m, T)
% % T - вектор размера Lx1 со значениями температур (в К)

N = size(q,2);  
L = size(T,1);  

h = 1.05457e-27; % Erg * s % h_bar
k = 1.380649e-16; % Erg / K
c = 29979245800;  % cm / s

E =@(f, T) h.*f.*(1/2 + 1./(exp(h.*f/(k*T))-1));

A2 = zeros(3*N-6, L);

for i = 1:3*N-6
    V = [Dr(i, 1:3:3*N); Dr(i, 2:3:3*N); Dr(i, 3:3:3*N)]; % Dr2 = Dr(:, 1:3:3*N).^2 + Dr(:, 2:3:3*N).^2 + Dr(:, 3:3:3*N).^2;
    
    A2(i,:) = 2*E(Fr(i), T)./(Fr(i)^2 * sum( (V(1,:).^2 + V(2,:).^2 + V(3,:).^2).*m ) );
    
    I(i,:) = 2/(3*c^3) * Fr(i)^4 * norm(sum(V.*q , 2)).^2 .* A2;
end

I = I';

% % I - матрица размера Lx(3N-6) со значениями мощности дипольного излучения молекулы
% % на каждой колебательной частоте и для каждого значения температуры.  (эВ/сек)
end